In [3]:
from pandas import DataFrame
df = DataFrame(
               [
                ['Aryan','Singh','Full-time','Administration',2,20000],
                ['Rohan','Agarwal','Intern','Technical',3,5000],
                   ['Riya','Shah','Full-time','Administration',5,100000],
                   ['Yash','Bhatia','Part-time','Technical',7,100000],
                   ['Siddhant','Khanna','Full-time','Management',6,200000]
               ]
               ,columns=['First Name','last Name','Type','Department','YoE','Salary']
              )
df

  First Name last Name       Type      Department  YoE  Salary
0      Aryan     Singh  Full-time  Administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full-time  Administration    5  100000
3       Yash    Bhatia  Part-time       Technical    7  100000
4   Siddhant    Khanna  Full-time      Management    6  200000

In [4]:
df[["Type","Salary"]]

        Type  Salary
0  Full-time   20000
1     Intern    5000
2  Full-time  100000
3  Part-time  100000
4  Full-time  200000